Assignment_1/FIO/q5/output_q5.txt
job1: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
job2: (g=1): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
job3: (g=2): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
job4: (g=3): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
job5: (g=4): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 5 processes
job1: Laying out IO file (1 file / 1024MiB)
job2: Laying out IO file (1 file / 1639MiB)
job3: Laying out IO file (1 file / 1680MiB)

job1: (groupid=0, jobs=1): err= 0: pid=309832: Fri Apr 11 18:33:47 2025
  read: IOPS=1939, BW=1939MiB/s (2034MB/s)(1024MiB/528msec)
    clat (usec): min=349, max=952, avg=413.86, stdev=39.83
     lat (usec): min=349, max=953, avg=414.07, stdev=39.87
    clat percentiles (usec):
     |  1.00th=[  355],  5.00th=[  367], 10.00th=[  375], 20.00th=[  400],
     | 30.00th=[  404], 40.00th=[  404], 50.00th=[  408], 60.00th=[  412],
     | 70.00th=[  416], 80.00th=[  420], 90.00th=[  449], 95.00th=[  482],
     | 99.00th=[  570], 99.50th=[  570], 99.90th=[  742], 99.95th=[  955],
     | 99.99th=[  955]
   bw (  MiB/s): min= 1938, max= 1938, per=99.97%, avg=1938.81, stdev= 0.00, samples=1
   iops        : min= 1938, max= 1938, avg=1938.00, stdev= 0.00, samples=1
  lat (usec)   : 500=96.09%, 750=3.81%, 1000=0.10%
  cpu          : usr=0.57%, sys=40.42%, ctx=1046, majf=0, minf=267
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1024,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job2: (groupid=1, jobs=1): err= 0: pid=309833: Fri Apr 11 18:33:47 2025
  read: IOPS=1878, BW=1879MiB/s (1970MB/s)(1024MiB/545msec)
    clat (usec): min=373, max=4344, avg=444.57, stdev=174.84
     lat (usec): min=373, max=4344, avg=444.72, stdev=174.85
    clat percentiles (usec):
     |  1.00th=[  375],  5.00th=[  379], 10.00th=[  383], 20.00th=[  392],
     | 30.00th=[  408], 40.00th=[  420], 50.00th=[  433], 60.00th=[  441],
     | 70.00th=[  449], 80.00th=[  474], 90.00th=[  502], 95.00th=[  529],
     | 99.00th=[  603], 99.50th=[  660], 99.90th=[ 4146], 99.95th=[ 4359],
     | 99.99th=[ 4359]
  lat (usec)   : 500=89.26%, 750=10.55%
  lat (msec)   : 10=0.20%
  cpu          : usr=0.18%, sys=34.93%, ctx=1034, majf=0, minf=268
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1024,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job3: (groupid=2, jobs=1): err= 0: pid=309834: Fri Apr 11 18:33:47 2025
  read: IOPS=2192, BW=2193MiB/s (2299MB/s)(1024MiB/467msec)
    clat (usec): min=354, max=2367, avg=452.72, stdev=81.75
     lat (usec): min=354, max=2368, avg=452.88, stdev=81.78
    clat percentiles (usec):
     |  1.00th=[  363],  5.00th=[  371], 10.00th=[  383], 20.00th=[  412],
     | 30.00th=[  420], 40.00th=[  433], 50.00th=[  445], 60.00th=[  453],
     | 70.00th=[  469], 80.00th=[  494], 90.00th=[  523], 95.00th=[  545],
     | 99.00th=[  635], 99.50th=[  668], 99.90th=[  734], 99.95th=[ 2376],
     | 99.99th=[ 2376]
  lat (usec)   : 500=82.32%, 750=17.58%
  lat (msec)   : 4=0.10%
  cpu          : usr=0.21%, sys=44.42%, ctx=1024, majf=0, minf=268
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1024,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job4: (groupid=3, jobs=1): err= 0: pid=309835: Fri Apr 11 18:33:47 2025
  read: IOPS=2409, BW=2409MiB/s (2526MB/s)(1024MiB/425msec)
    clat (usec): min=350, max=2373, avg=413.60, stdev=76.54
     lat (usec): min=350, max=2374, avg=413.68, stdev=76.56
    clat percentiles (usec):
     |  1.00th=[  363],  5.00th=[  367], 10.00th=[  367], 20.00th=[  371],
     | 30.00th=[  383], 40.00th=[  392], 50.00th=[  408], 60.00th=[  416],
     | 70.00th=[  420], 80.00th=[  433], 90.00th=[  469], 95.00th=[  498],
     | 99.00th=[  603], 99.50th=[  668], 99.90th=[  709], 99.95th=[ 2376],
     | 99.99th=[ 2376]
  lat (usec)   : 500=95.12%, 750=4.79%
  lat (msec)   : 4=0.10%
  cpu          : usr=0.94%, sys=28.77%, ctx=1024, majf=0, minf=267
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1024,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job5: (groupid=4, jobs=1): err= 0: pid=309836: Fri Apr 11 18:33:47 2025
  read: IOPS=2449, BW=2450MiB/s (2569MB/s)(1024MiB/418msec)
    clat (usec): min=352, max=2283, avg=406.78, stdev=70.42
     lat (usec): min=352, max=2284, avg=406.88, stdev=70.45
    clat percentiles (usec):
     |  1.00th=[  355],  5.00th=[  367], 10.00th=[  367], 20.00th=[  371],
     | 30.00th=[  379], 40.00th=[  383], 50.00th=[  396], 60.00th=[  416],
     | 70.00th=[  420], 80.00th=[  424], 90.00th=[  457], 95.00th=[  486],
     | 99.00th=[  529], 99.50th=[  562], 99.90th=[  709], 99.95th=[ 2278],
     | 99.99th=[ 2278]
  lat (usec)   : 500=97.46%, 750=2.44%
  lat (msec)   : 4=0.10%
  cpu          : usr=0.48%, sys=30.94%, ctx=1024, majf=0, minf=268
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1024,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1939MiB/s (2034MB/s), 1939MiB/s-1939MiB/s (2034MB/s-2034MB/s), io=1024MiB (1074MB), run=528-528msec

Run status group 1 (all jobs):
   READ: bw=1879MiB/s (1970MB/s), 1879MiB/s-1879MiB/s (1970MB/s-1970MB/s), io=1024MiB (1074MB), run=545-545msec

Run status group 2 (all jobs):
   READ: bw=2193MiB/s (2299MB/s), 2193MiB/s-2193MiB/s (2299MB/s-2299MB/s), io=1024MiB (1074MB), run=467-467msec

Run status group 3 (all jobs):
   READ: bw=2409MiB/s (2526MB/s), 2409MiB/s-2409MiB/s (2526MB/s-2526MB/s), io=1024MiB (1074MB), run=425-425msec

Run status group 4 (all jobs):
   READ: bw=2450MiB/s (2569MB/s), 2450MiB/s-2450MiB/s (2569MB/s-2569MB/s), io=1024MiB (1074MB), run=418-418msec

Disk stats (read/write):
  nvme0n1: ios=37858/0, merge=0/0, ticks=6966/0, in_queue=6966, util=45.69%